#!/usr/bin/env python
# -*- coding: utf-8 -*-

# в саду сорвали цветы
garden = ('ромашка', 'роза', 'одуванчик', 'ромашка',
          'гладиолус', 'подсолнух', 'роза')

# на лугу сорвали цветы
meadow = ('клевер', 'одуванчик', 'ромашка',
          'клевер', 'мак', 'одуванчик', 'ромашка')

# создайте множество цветов, произрастающих в саду и на лугу
garden_set = set(garden)
meadow_set = set(meadow)

# выведите на консоль все виды цветов
all_flowers = garden_set.union(meadow_set)
print(', '.join(all_flowers))

# выведите на консоль те, которые растут и там и там
garden_and_meadow = garden_set.intersection(meadow_set)
print(', '.join(garden_and_meadow))


# выведите на консоль те, которые растут в саду, но не растут на лугу
only_garden = garden_set.difference(meadow_set)
print(', '.join(only_garden))

# выведите на консоль те, которые растут на лугу, но не растут в саду
only_meadow = meadow_set.difference(garden_set)
print(', '.join(only_meadow))

# NOTE можно использовать и более компактный способ решения - операторы. Например:
#           flowers_set = garden_set | meadow_set               # объединения
#           flower_garden_meadow = garden_set & meadow_set      # пересечение
#           flower_meadow_only = meadow_set - garden_set        # вычитание

# зачёт! 🚀
